# Задача 1: Анализатор расходов

import json
from collections import defaultdict

# Создаем файл с данными на русском
expenses_data = [
    {"категория": "еда", "сумма": 1500, "дата": "2023-11-15"},
    {"категория": "транспорт", "сумма": 800, "дата": "2023-11-16"},
    {"категория": "еда", "сумма": 1200, "дата": "2023-11-17"},
    {"категория": "развлечения", "сумма": 3000, "дата": "2023-11-15"},
    {"категория": "транспорт", "сумма": 600, "дата": "2023-11-17"},
    {"категория": "еда", "сумма": 900, "дата": "2023-11-18"}
]

# Сохраняем в файл
with open('расходы.json', 'w', encoding='utf-8') as f:
    json.dump(expenses_data, f, ensure_ascii=False, indent=2)

# Читаем файл
with open('расходы.json', 'r', encoding='utf-8') as f:
    расходы = json.load(f)

# 1. Общая сумма расходов
общая_сумма = sum(item['сумма'] for item in расходы)
print(f"Общая сумма расходов: {общая_сумма} руб.")

# 2. Категория с наибольшими тратами
категории = defaultdict(int)
for item in расходы:
    категории[item['категория']] += item['сумма']

макс_категория = max(категории, key=категории.get)
print(f"Больше всего потрачено на: {макс_категория} ({категории[макс_категория]} руб.)")

# 3. Дата с наибольшими тратами
даты = defaultdict(int)
for item in расходы:
    даты[item['дата']] += item['сумма']

макс_дата = max(даты, key=даты.get)
print(f"Самый дорогой день: {макс_дата} ({даты[макс_дата]} руб.)")

# Подробная статистика
print("\nСтатистика по категориям:")
for категория, сумма in категории.items():
    print(f"  {категория}: {сумма} руб.")

print("\nСтатистика по дням:")
for дата, сумма in даты.items():
    print(f"  {дата}: {сумма} руб.")